<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>_metadata</key>
	<dict>
		<key>created_by</key>
		<string>tobias</string>
		<key>creation_date</key>
		<date>2018-10-18T13:26:57Z</date>
		<key>munki_version</key>
		<string>3.3.1.3537</string>
		<key>os_version</key>
		<string>10.13.6</string>
	</dict>
	<key>autoremove</key>
	<false/>
	<key>catalogs</key>
	<array>
		<string>testing</string>
	</array>
	<key>description</key>
	<string>Fix borked MAU preferences by removing the plist for all users.</string>
	<key>display_name</key>
	<string>Fix MAU Prefs</string>
	<key>minimum_os_version</key>
	<string>10.10.0</string>
    <key>installer_type</key>
    <string>nopkg</string>
	<key>name</key>
	<string>removeMAUprefs</string>
	<key>postinstall_script</key>
	<string>#!/bin/bash

# fix borked MAU preferences by removing the plist for all users
# because this was caused by

/usr/bin/find /Users/*/Library/Preferences -name "com.microsoft.autoupdate2.plist" -delete

# refresh preferences cache to prevent
killall cfprefsd

# plant a flag that we ran that we ran
if [ ! -d /Library/Management/Utilities/ ]; then
	/bin/echo "Management directory does not exist. Creating it now."
	/bin/mkdir -p /Library/Management/Utilities
	/usr/bin/touch /Library/Management/Utilities/removeMAUdone
else
	/bin/echo "Management directory exists. Planting flag."
	/usr/bin/touch /Library/Management/Utilities/removeMAUdone
fi

exit 0
</string>
	<key>installcheck_script</key>
	<string>#!/bin/bash
if [ -f "/Library/Management/Utilities/removeMAUdone" ]; then
	/bin/echo "Flag exists. Exiting."
	exit 1
else
	/bin/echo "Flag does not exist. Running removal."
	exit 0
fi
</string>
	<key>version</key>
	<string>1.0</string>
	<key>unattended_install</key>
	<true/>
	<key>unattended_uninstall</key>
	<true/>
	<key>uninstallable</key>
	<true/>
</dict>
</plist>